In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = Series([3,6,9,12])

In [3]:
obj

0     3
1     6
2     9
3    12
dtype: int64

In [4]:
obj.values

array([ 3,  6,  9, 12])

In [10]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
ww2_cas = Series([8700000,4300000,3000000,2100000,400000],index = ['USSR','Germany','China','Japan','USA'])

ww2_cas

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
USA         400000
dtype: int64

In [13]:
ww2_cas['China']

3000000

In [15]:
ww2_cas[ww2_cas > 4000000]

USSR       8700000
Germany    4300000
dtype: int64

In [16]:
'USA' in ww2_cas

True

In [18]:
'asdf' in ww2_cas

False

In [19]:
ww2_dict = ww2_cas.to_dict()

In [20]:
ww2_dict

{'USSR': 8700000,
 'Germany': 4300000,
 'China': 3000000,
 'Japan': 2100000,
 'USA': 400000}

In [22]:
ww2_series = Series(ww2_dict)
ww2_series

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
USA         400000
dtype: int64

In [23]:
countries = ['China','Germany','Japan','USA','USSR','Argentina']

In [24]:
obj2 = Series(ww2_dict,index = countries)

In [25]:
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
dtype: float64

In [26]:
pd.isnull(obj2)

China        False
Germany      False
Japan        False
USA          False
USSR         False
Argentina     True
dtype: bool

In [27]:
pd.notnull(obj2)

China         True
Germany       True
Japan         True
USA           True
USSR          True
Argentina    False
dtype: bool

In [28]:
ww2_series + obj2

Argentina           NaN
China         6000000.0
Germany       8600000.0
Japan         4200000.0
USA            800000.0
USSR         17400000.0
dtype: float64

In [29]:
obj2.name = 'World War 2 Casualties'

In [30]:
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
Name: World War 2 Casualties, dtype: float64

In [31]:
obj2.index.name = 'Countries'

In [32]:
obj2

Countries
China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
Name: World War 2 Casualties, dtype: float64

In [2]:
#DATAFRAME

In [3]:
import webbrowser

In [4]:
website = 'https://en.wikipedia.org/wiki/NFL_win-loss_records'

In [5]:
webbrowser.open(website)

True

In [8]:
nfl_frame = pd.read_clipboard()

In [ ]:
# clipboard - to co zaznaczy≈Çes i skopiowales np na stronie wikipedi jak w tym przypadku

In [9]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,898,512,380,6,0.573,1960,NFC East
1,2,Chicago Bears,"1,386",761,583,42,0.564,1920,NFC North
2,3,Green Bay Packers,"1,352",743,571,38,0.564,1921,NFC North
3,4,New England Patriots[b],900,500,391,9,0.561,1960,AFC East
4,5,Miami Dolphins,816,452,360,4,0.556,1966,AFC East

In [10]:
nfl_frame.columns

Index(['Rank', 'Team', 'GP', 'Won', 'Lost', 'Tied', 'Pct.', 'First NFL Season',
       'Division'],
      dtype='object')

In [12]:
nfl_frame.Won

0    512
1    761
2    743
3    500
4    452
Name: Won, dtype: int64

In [13]:
nfl_frame['First NFL Season']

0    1960
1    1920
2    1921
3    1960
4    1966
Name: First NFL Season, dtype: int64

In [14]:
nfl_frame[['GP','Tied']]

      GP  Tied
0    898     6
1  1,386    42
2  1,352    38
3    900     9
4    816     4

In [15]:
DataFrame(nfl_frame,columns= ['Team','GP','Tied'])

                      Team     GP  Tied
0           Dallas Cowboys    898     6
1            Chicago Bears  1,386    42
2        Green Bay Packers  1,352    38
3  New England Patriots[b]    900     9
4           Miami Dolphins    816     4

In [16]:
DataFrame(nfl_frame,columns= ['Team','GP','Tied','Stadium'])

                      Team     GP  Tied  Stadium
0           Dallas Cowboys    898     6      NaN
1            Chicago Bears  1,386    42      NaN
2        Green Bay Packers  1,352    38      NaN
3  New England Patriots[b]    900     9      NaN
4           Miami Dolphins    816     4      NaN

In [17]:
nfl_frame.head(2)

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,898,512,380,6,0.573,1960,NFC East
1,2,Chicago Bears,"1,386",761,583,42,0.564,1920,NFC North

In [18]:
nfl_frame.tail(3)

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
2,3,Green Bay Packers,"1,352",743,571,38,0.564,1921,NFC North
3,4,New England Patriots[b],900,500,391,9,0.561,1960,AFC East
4,5,Miami Dolphins,816,452,360,4,0.556,1966,AFC East

In [26]:
nfl_frame.iloc[3]

Rank                                      4
Team                New England Patriots[b]
GP                                      900
Won                                     500
Lost                                    391
Tied                                      9
Pct.                                  0.561
First NFL Season                       1960
Division                           AFC East
Name: 3, dtype: object

In [27]:
nfl_frame['Stadium'] = 'National Stadium'

In [28]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,898,512,380,6,0.573,1960,NFC East,National Stadium
1,2,Chicago Bears,"1,386",761,583,42,0.564,1920,NFC North,National Stadium
2,3,Green Bay Packers,"1,352",743,571,38,0.564,1921,NFC North,National Stadium
3,4,New England Patriots[b],900,500,391,9,0.561,1960,AFC East,National Stadium
4,5,Miami Dolphins,816,452,360,4,0.556,1966,AFC East,National Stadium

In [29]:
nfl_frame['Stadium'] = np.arange(5)
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,898,512,380,6,0.573,1960,NFC East,0
1,2,Chicago Bears,"1,386",761,583,42,0.564,1920,NFC North,1
2,3,Green Bay Packers,"1,352",743,571,38,0.564,1921,NFC North,2
3,4,New England Patriots[b],900,500,391,9,0.561,1960,AFC East,3
4,5,Miami Dolphins,816,452,360,4,0.556,1966,AFC East,4

In [36]:
stadiums = Series(['A','B'],index=[4,0])
stadiums

4    A
0    B
dtype: object

In [37]:
nfl_frame['Stadium'] = stadiums
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,898,512,380,6,0.573,1960,NFC East,B
1,2,Chicago Bears,"1,386",761,583,42,0.564,1920,NFC North,NaN
2,3,Green Bay Packers,"1,352",743,571,38,0.564,1921,NFC North,NaN
3,4,New England Patriots[b],900,500,391,9,0.561,1960,AFC East,NaN
4,5,Miami Dolphins,816,452,360,4,0.556,1966,AFC East,A

In [38]:
del nfl_frame['Stadium']
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,898,512,380,6,0.573,1960,NFC East
1,2,Chicago Bears,"1,386",761,583,42,0.564,1920,NFC North
2,3,Green Bay Packers,"1,352",743,571,38,0.564,1921,NFC North
3,4,New England Patriots[b],900,500,391,9,0.561,1960,AFC East
4,5,Miami Dolphins,816,452,360,4,0.556,1966,AFC East

In [39]:
data = {'City':['SF','LA','NYC'],
        'Population':[837000,3880000,8400000]}

In [40]:
data

{'City': ['SF', 'LA', 'NYC'], 'Population': [837000, 3880000, 8400000]}

In [41]:
city_frame = DataFrame(data)
city_frame

  City  Population
0   SF      837000
1   LA     3880000
2  NYC     8400000

In [1]:
#Indexing

In [3]:
my_ser = Series([1,2,3], index=['A','B','C'])

In [4]:
my_ix = my_ser.index

my_ix

Index(['A', 'B', 'C'], dtype='object')

In [6]:
#error bo indexy nie wspieraja mutable operations
my_ix[0] = 'z'

TypeError: Index does not support mutable operations

In [7]:
#Reindex

In [8]:
from numpy.random import randn

In [11]:
ser = my_ser.reindex(['A','U','C','X','Y'])

In [12]:
ser

A    1.0
U    NaN
C    3.0
X    NaN
Y    NaN
dtype: float64

In [18]:
# fill_value dziala na nowe indexy G . Nie jest to fill_na
ser.reindex(['A','U','C','X','Y','G'],fill_value = 0)

A    1.0
U    NaN
C    3.0
X    NaN
Y    NaN
G    0.0
dtype: float64

In [20]:
ser1 = Series(['USA','Mexico','Canada'],index=[0,5,10])

ser1

0        USA
5     Mexico
10    Canada
dtype: object

In [21]:
ser1.reindex(range(15),method = 'ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [28]:
dframe = DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'],
                   columns=['col1','col2','col3','col4','col5'])

dframe

       col1      col2      col3      col4      col5
A  0.900731  0.016081  0.238858 -1.170147 -1.359025
B  1.182527 -0.534709 -0.464213  1.823835  1.088227
D -0.106929 -0.524484 -0.176222  1.448987 -0.765488
E -0.270249  0.685669  0.772697  1.046322 -0.010444
F -1.420725  0.443759  1.669995 -0.986103  0.861889

In [29]:
dframe1 = dframe.reindex(['A','B','C','D','E','F'])

dframe1

       col1      col2      col3      col4      col5
A  0.900731  0.016081  0.238858 -1.170147 -1.359025
B  1.182527 -0.534709 -0.464213  1.823835  1.088227
C       NaN       NaN       NaN       NaN       NaN
D -0.106929 -0.524484 -0.176222  1.448987 -0.765488
E -0.270249  0.685669  0.772697  1.046322 -0.010444
F -1.420725  0.443759  1.669995 -0.986103  0.861889

In [30]:
dframe1 = dframe.reindex(columns=['col1','col2','col3','col4','col5','col6'])
dframe1

       col1      col2      col3      col4      col5  col6
A  0.900731  0.016081  0.238858 -1.170147 -1.359025   NaN
B  1.182527 -0.534709 -0.464213  1.823835  1.088227   NaN
D -0.106929 -0.524484 -0.176222  1.448987 -0.765488   NaN
E -0.270249  0.685669  0.772697  1.046322 -0.010444   NaN
F -1.420725  0.443759  1.669995 -0.986103  0.861889   NaN

In [31]:
dframe

       col1      col2      col3      col4      col5
A  0.900731  0.016081  0.238858 -1.170147 -1.359025
B  1.182527 -0.534709 -0.464213  1.823835  1.088227
D -0.106929 -0.524484 -0.176222  1.448987 -0.765488
E -0.270249  0.685669  0.772697  1.046322 -0.010444
F -1.420725  0.443759  1.669995 -0.986103  0.861889

In [36]:
dframe.loc[['A','B','C','D','E','F'],['col1','col2','col3','col4','col5','col6']]

       col1      col2      col3      col4      col5  col6
A  0.900731  0.016081  0.238858 -1.170147 -1.359025   NaN
B  1.182527 -0.534709 -0.464213  1.823835  1.088227   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -0.106929 -0.524484 -0.176222  1.448987 -0.765488   NaN
E -0.270249  0.685669  0.772697  1.046322 -0.010444   NaN
F -1.420725  0.443759  1.669995 -0.986103  0.861889   NaN

In [37]:
#drop

In [41]:
ser1 = Series(np.arange(3),index = ['A','B','C'])

In [39]:
ser1

A    0
B    1
C    2
dtype: int64

array([0, 1, 2])

In [42]:
ser1.drop('B')

A    0
C    2
dtype: int64

In [45]:
dframe1 = DataFrame(np.arange(9).reshape(3,3),index=['SY','LA','NY'],columns=['year','pop','size'])

In [46]:
dframe1

    year  pop  size
SY     0    1     2
LA     3    4     5
NY     6    7     8

In [47]:
dframe1.drop('LA')

    year  pop  size
SY     0    1     2
NY     6    7     8

In [54]:
dframe1.drop('year',axis=1)

    pop  size
SY    1     2
LA    4     5
NY    7     8

In [55]:
#Selecting

In [56]:
ser1 = Series(2*np.arange(3),index=['A','B','C'])

In [57]:
ser1

A    0
B    2
C    4
dtype: int64

In [58]:
ser1['B']

2

In [59]:
ser1[1]

2

In [60]:
ser1[1:]

B    2
C    4
dtype: int64

In [61]:
ser1[['A','B']]

A    0
B    2
dtype: int64

In [66]:
ser1[ser1 > 2] = 10
ser1

A     0
B     2
C    10
dtype: int64

In [70]:
df = DataFrame(np.arange(25).reshape(5,5),index=['A','B','C','D','E'],
               columns=['col1','col2','col3','col4','col5'])

df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19
E    20    21    22    23    24

In [71]:
df['col3']

A     2
B     7
C    12
D    17
E    22
Name: col3, dtype: int64

In [72]:
df[['col2','col5']]

   col2  col5
A     1     4
B     6     9
C    11    14
D    16    19
E    21    24

In [73]:
df[df['col3'] > 8]

   col1  col2  col3  col4  col5
C    10    11    12    13    14
D    15    16    17    18    19
E    20    21    22    23    24

In [75]:
df > 12

    col1   col2   col3   col4   col5
A  False  False  False  False  False
B  False  False  False  False  False
C  False  False  False   True   True
D   True   True   True   True   True
E   True   True   True   True   True

In [76]:
df.loc[['B','D'],['col1','col4']]

   col1  col4
B     5     8
D    15    18